In [16]:
import numpy as np
import pandas as pd

In [17]:
url = 'https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv'
file1_df = pd.read_csv(url)

In [18]:
file1_df.head()

,Customer,ST,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

In [19]:
# cleaning column names
file1_df.columns = file1_df.columns.str.lower()

In [20]:
file1_df.head()

,customer,st,gender,education,customer lifetime value,income,monthly premium auto,number of open complaints,policy type,vehicle class,total claim amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

In [21]:
file1_df.rename(columns={'st': 'state'}, inplace=True)

In [22]:
file1_df.head()

,customer,state,gender,education,customer lifetime value,income,monthly premium auto,number of open complaints,policy type,vehicle class,total claim amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

In [23]:
file1_df.rename(columns={'customer lifetime value': 'customer_lifetime_value', 'monthly premium auto': 'monthly_premium_auto'}, inplace=True)

In [24]:
file1_df.head()

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number of open complaints,policy type,vehicle class,total claim amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

In [25]:
file1_df.rename(columns={'number of open complaints': 'number_of_open_complaints', 'policy type': 'policy_type', 'vehicle class': 'vehicle_class', 'total claim amount': 'total_claim_amount'}, inplace=True)

In [26]:
file1_df.head()

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

In [27]:
# cleaning invalid values

In [28]:
unique_gender_values = file1_df['gender'].unique()
print(unique_gender_values)

[nan 'F' 'M' 'Femal' 'Male' 'female']

In [29]:
file1_df['gender'] = file1_df['gender'].replace({
    'Femal': 'F',
    'Male': 'M',
    'female': 'F'
})

In [30]:
unique_gender_values = file1_df['gender'].unique()
print(unique_gender_values)

[nan 'F' 'M']

In [31]:
unique_states_values = file1_df['state'].unique()
print(unique_states_values)

['Washington' 'Arizona' 'Nevada' 'California' 'Oregon' 'Cali' 'AZ' 'WA'
 nan]

In [32]:
file1_df['state'] = file1_df['state'].replace({
    'Cali': 'California',
    'WA': 'Washington',
    'AZ': 'Arizona'
})

In [33]:
unique_state_values = file1_df['state'].unique()
print(unique_state_values)

['Washington' 'Arizona' 'Nevada' 'California' 'Oregon' nan]

In [34]:
unique_education_values = file1_df['education'].unique()
print(unique_education_values)

['Master' 'Bachelor' 'High School or Below' 'College' 'Bachelors' 'Doctor'
 nan]

In [35]:
file1_df['education'] = file1_df['education'].replace({'Bachelors': 'Bachelor'})

In [36]:
unique_education_values = file1_df['education'].unique()
print(unique_education_values)

['Master' 'Bachelor' 'High School or Below' 'College' 'Doctor' nan]

In [37]:
file1_df['customer_lifetime_value'] = file1_df['customer_lifetime_value'].str.replace('%', '')

In [38]:
unique_customer_life_values = file1_df['customer_lifetime_value'].unique()
print(unique_customer_life_values)

[nan '697953.59' '1288743.17' ... '2031499.76' '323912.47' '899704.02']

In [39]:
unique_vehicle_class = file1_df['vehicle_class'].unique()
print(unique_vehicle_class)

['Four-Door Car' 'Two-Door Car' 'SUV' 'Luxury SUV' 'Sports Car'
 'Luxury Car' nan]

In [40]:
file1_df['vehicle_class'] = file1_df['vehicle_class'].replace({'Luxury SUV': 'Luxury', 'Luxury Car': 'Luxury', 'Sports Car': 'Luxury'})

In [41]:
unique_vehicle_class = file1_df['vehicle_class'].unique()
print(unique_vehicle_class)

['Four-Door Car' 'Two-Door Car' 'SUV' 'Luxury' nan]

In [42]:
# formatting data types

In [43]:
data_type = file1_df['customer_lifetime_value'].dtype
print(data_type)

object

In [44]:
file1_df['customer_lifetime_value'] = pd.to_numeric(file1_df['customer_lifetime_value'])

In [45]:
data_type = file1_df['customer_lifetime_value'].dtype
print(data_type)

float64

In [46]:
# dealing with issue for column "number_of_open_complains"

In [47]:
data_type = file1_df['number_of_open_complaints'].dtype
print(data_type)

object

In [48]:
unique_number_of_open_complaints_values = file1_df['number_of_open_complaints'].unique()
print(unique_number_of_open_complaints_values)

['1/0/00' '1/2/00' '1/1/00' '1/3/00' '1/5/00' '1/4/00' nan]

In [49]:
#checking columns name
print(file1_df.columns)

Index(['customer', 'state', 'gender', 'education', 'customer_lifetime_value',
       'income', 'monthly_premium_auto', 'number_of_open_complaints',
       'policy_type', 'vehicle_class', 'total_claim_amount'],
      dtype='object')

In [53]:
complaints = list(file1_df['number_of_open_complaints'])
complaints_new = []
for complaint in complaints:
      complaint = str(complaint)
      if complaint != 'nan':
            complaint = complaint.split('/')
            complaints_new.append(int(complaint[1]))
      else:
            complaints_new.append(complaint)

In [54]:
file1_df['number_of_open_complaints'] = complaints_new

In [55]:
file1_df.head()

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount,number of open complaints
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,0,Personal Auto,Four-Door Car,2.704934,0
1,QZ44356,Arizona,F,Bachelor,697953.59,0.0,94.0,0,Personal Auto,Four-Door Car,1131.464935,0
2,AI49188,Nevada,F,Bachelor,1288743.17,48767.0,108.0,0,Personal Auto,Two-Door Car,566.472247,0
3,WW63253,California,M,Bachelor,764586.18,0.0,106.0,0,Corporate Auto,SUV,529.881344,0
4,GA49547,Washington,M,High School or Below,536307.65,36357.0,68.0,0,Personal Auto,Four-Door Car,17.269323,0

In [ ]:
# 4. Dealing with null values

In [56]:
# checking which cell has null value in the column
null_counts = file1_df.isnull()
null_counts

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount,number of open complaints
0,False,False,True,False,True,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...
4003,True,True,True,True,True,True,True,False,True,True,True,False
4004,True,True,True,True,True,True,True,False,True,True,True,False
4005,True,True,True,True,True,True,True,False,True,True,True,False
4006,True,True,True,True,True,True,True,False,True,True,True,False
4007,True,True,True,True,True,True,True,False,True,True,True,False

In [57]:
# counting null values

null_counts = file1_df.isnull().sum()
null_counts

customer                     2937
state                        2937
gender                       3054
education                    2937
customer_lifetime_value      2940
income                       2937
monthly_premium_auto         2937
number_of_open_complaints       0
policy_type                  2937
vehicle_class                2937
total_claim_amount           2937
number of open complaints       0
dtype: int64

In [58]:
# dropping null values
file1_df.dropna(axis=0, inplace=True)

In [59]:
# checking for null values again
null_counts = file1_df.isnull()
null_counts

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount,number of open complaints
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,False
5,False,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...
1066,False,False,False,False,False,False,False,False,False,False,False,False
1067,False,False,False,False,False,False,False,False,False,False,False,False
1068,False,False,False,False,False,False,False,False,False,False,False,False
1069,False,False,False,False,False,False,False,False,False,False,False,False
1070,False,False,False,False,False,False,False,False,False,False,False,False

In [60]:
null_counts = file1_df.isnull().sum()
null_counts

customer                     0
state                        0
gender                       0
education                    0
customer_lifetime_value      0
income                       0
monthly_premium_auto         0
number_of_open_complaints    0
policy_type                  0
vehicle_class                0
total_claim_amount           0
number of open complaints    0
dtype: int64

In [ ]:
# I implemented drop null function because i wanted to try for now easy methon but for sure it would be better to replace all with mean.

In [62]:
# checking numericl and categorical columns
numerical_cols = file1_df.select_dtypes(include=['number']).columns
categorical_cols = file1_df.select_dtypes(exclude=['number']).columns
numerical_cols

Index(['customer_lifetime_value', 'income', 'monthly_premium_auto',
       'total_claim_amount'],
      dtype='object')

In [63]:
categorical_cols

Index(['customer', 'state', 'gender', 'education', 'number_of_open_complaints',
       'policy_type', 'vehicle_class', 'number of open complaints'],
      dtype='object')

In [64]:
# converting all the numeric variables to integers using applymap.
numerical_columns = ['customer_lifetime_value', 'income', 'monthly_premium_auto', 'total_claim_amount']
file1_df[numerical_columns] = file1_df[numerical_columns].applymap(int)

In [65]:
file1_df.head()

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount,number of open complaints
1,QZ44356,Arizona,F,Bachelor,697953,0,94,0,Personal Auto,Four-Door Car,1131,0
2,AI49188,Nevada,F,Bachelor,1288743,48767,108,0,Personal Auto,Two-Door Car,566,0
3,WW63253,California,M,Bachelor,764586,0,106,0,Corporate Auto,SUV,529,0
4,GA49547,Washington,M,High School or Below,536307,36357,68,0,Personal Auto,Four-Door Car,17,0
5,OC83172,Oregon,F,Bachelor,825629,62902,69,0,Personal Auto,Two-Door Car,159,0

In [ ]:
# 5. Dealing with duplicates

In [66]:
file1_df.duplicated()

1       False
2       False
3       False
4       False
5       False
        ...
1066    False
1067    False
1068    False
1069    False
1070    False
Length: 952, dtype: bool

In [67]:
file1_df.duplicated().sum()

0

In [ ]:
# after i used dropna method, there are no duplicates. but if i would have duplicates i would use function file1_df.drop_duplicates(inplace=True)

In [ ]:
# saing go csv file

In [68]:
file_path = 'lab-data-cleaning2.csv'  # Replace 'output_file.csv' with your desired file name and path
file1_df.to_csv(file_path, index=False)